# DATA WRANGLING

In [2]:
# important Libraries
# pip install pandas
# pip install matplotlib
# pip install seaborn

In [3]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

In [31]:
kashti=sns.load_dataset('titanic')
k1=kashti 
k2=kashti 
k=sns.load_dataset('titanic')

In [5]:
kashti.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [6]:
kashti.shape

(891, 15)

In [7]:
#simple  operations(Maths Operations)
(kashti['age']+12).head(10)

0    34.0
1    50.0
2    38.0
3    47.0
4    47.0
5     NaN
6    66.0
7    14.0
8    39.0
9    26.0
Name: age, dtype: float64

# Dealing With Missing Values
- In a data set missing values  are either ? or N/A or NaN or 0 or blank cell
- Jab kabhi data na ho kisi aik row main kisi b aik parameter ka 
  > Steps:
  1. koshish kra dobara data collect krla ya dekh len agr kahin galti ha 
  2. Missing Value wala variable (coloumn)  hi nikal den agar data perfect nahi ata ha ya simple row or data entry 
     remove kar den
  3. Replace the missing values:
     1. How ?
        1. Average value of entire variable or similar data  point 
        2. frequency or Mode replacement 
        3. Replace based on other fuctions (Data sampler knows that)
        4. ML algorithm can also be used 
        5. Leave it like that
     2. Why?
        1. Its better because no data is lost.
        2. Less accurate

In [8]:
#where exactly missing values are ?
kashti.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [9]:
print(kashti.shape)

(891, 15)

In [10]:
kashti.dropna(subset=['deck'],axis=0,inplace=True)
#this will remove NaN
#inplace = true modifies the dataframe

In [11]:
kashti.shape

(203, 15)

In [12]:
kashti.isnull().sum()

survived        0
pclass          0
sex             0
age            19
sibsp           0
parch           0
fare            0
embarked        2
class           0
who             0
adult_male      0
deck            0
embark_town     2
alive           0
alone           0
dtype: int64

In [13]:
kashti=kashti.dropna()
kashti.isnull().sum()
# Remove Na from Whole data frame

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64

In [14]:
kashti.shape

(182, 15)

In [15]:
k1.isnull().sum()

survived        0
pclass          0
sex             0
age            19
sibsp           0
parch           0
fare            0
embarked        2
class           0
who             0
adult_male      0
deck            0
embark_town     2
alive           0
alone           0
dtype: int64

In [16]:
#Replacing the missing values with average/mean of that column
mean=k1['age'].mean()
mean

35.77945652173913

In [17]:
k1['age']=k1['age'].replace(np.nan,mean)

In [18]:
k1.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       2
class          0
who            0
adult_male     0
deck           0
embark_town    2
alive          0
alone          0
dtype: int64

In [19]:
# mean=k1['deck'].mean()
#beacuse not a numerical value

# Data Formating 
- Data ko aik common standard per lana ha
- Ensures data is consistent and understandable
    - Easy to gahther
    - Easy to workwith
          - Faisalabad(FSD)
          - Lahore(LHR)
          - Islamabad (ISB)
          - Karachi (KCH)
          - Peshawar (PEW)
          - Jaisay chillay main log apni marzi karatay ha hamesha
          - Convert g to kg or similar uni for all
          - on estandard unit in each colummn
          - ft !=cm
          -

In [20]:
#Known the data type and covert  datatype from one to another format
kashti['survived']=kashti['survived'].astype('int64')
kashti.dtypes

C:\Users\MUDASSIR RAZA\AppData\Local\Temp\ipykernel_3896\2736598221.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  kashti['survived']=kashti['survived'].astype('int64')

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [21]:
# here we will convert  the age into days instead of years
k1['age']=k1['age']*365
k1.head(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,13870.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,12775.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,19710.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,1460.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,21170.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True

In [22]:
# k1['age']=kashti['age'].astype('int64')
# k1.head(10)
# remove 0000 from age

In [23]:

k1.rename(columns={'age':'age_in_days'},inplace=True)
k1.head()

,survived,pclass,sex,age_in_days,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,13870.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,12775.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,19710.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,1460.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,21170.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True

##

## **Data Normilization**
  - Uniform the data
  - they have same impact
  - Aik machli samandar main or aik jar main 
  - Also for computational reasons

In [24]:
kashti.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True

In [25]:
k4=kashti[["age",'fare']]
k4.head()

     age     fare
1   38.0  71.2833
3   35.0  53.1000
6   54.0  51.8625
10   4.0  16.7000
11  58.0  26.5500

- The Above data is really in wide range and we need to normalize and hard to compare
- Normalization the values to 0 to -1 (now both variable has similar influence on our models)

# Method of Normalization 
1. simple feature scalling 
    - x(new)=x(old)/x(max)
2. Min-Max Method 
3. Z-scored (standard score) -3 to +3
4. Log transformation

In [26]:
# simple feature scaling
k4['fare']=k4['fare']/k4['fare'].max()
k4['age']=k4['age']/k4['age'].max()
k4.head()

C:\Users\MUDASSIR RAZA\AppData\Local\Temp\ipykernel_3896\3363764364.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  k4['fare']=k4['fare']/k4['fare'].max()
C:\Users\MUDASSIR RAZA\AppData\Local\Temp\ipykernel_3896\3363764364.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  k4['age']=k4['age']/k4['age'].max()

       age      fare
1   0.4750  0.139136
3   0.4375  0.103644
6   0.6750  0.101229
10  0.0500  0.032596
11  0.7250  0.051822

In [27]:
# Min - Max method
k4['fare']=(k4['fare']-k4['fare'].min())/(k4['fare'].max()-k4['fare'].min())
k4.head()

C:\Users\MUDASSIR RAZA\AppData\Local\Temp\ipykernel_3896\2812567566.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  k4['fare']=(k4['fare']-k4['fare'].min())/(k4['fare'].max()-k4['fare'].min())

       age      fare
1   0.4750  0.139136
3   0.4375  0.103644
6   0.6750  0.101229
10  0.0500  0.032596
11  0.7250  0.051822

In [29]:
#Z - score (standard score)
k4['fare']=(k4['fare']-k4['fare'].mean())/k4['fare'].std()
k4.head()

C:\Users\MUDASSIR RAZA\AppData\Local\Temp\ipykernel_3896\4107706306.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  k4['fare']=(k4['fare']-k4['fare'].mean())/k4['fare'].std()

       age      fare
1   0.4750 -0.099835
3   0.4375 -0.337554
6   0.6750 -0.353732
10  0.0500 -0.813428
11  0.7250 -0.684654

In [32]:
k.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [33]:
k['fare']= np.log(k['fare'])
k.head()

c:\Users\MUDASSIR RAZA\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\core\arraylike.py:402: RuntimeWarning: divide by zero encountered in log
  result = getattr(ufunc, method)(*inputs, **kwargs)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,1.981001,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,4.266662,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,2.070022,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,3.972177,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,2.085672,S,Third,man,True,NaN,Southampton,no,True

# Binning 
 - Grouping of values into smaller number of values (bins)
 - Convert numeric into categories (jawan ,bachay,boorhay) or 1-16 ,17-30 etc
 - To have better understanding of groups
        - low mind vs high price

In [35]:
bins=np.linspace(min(kashti['age']),max(kashti['age']),15000)
age_groups=["Bachay","Jawan","Boorhay"]
kashti['age']=pd.cut(kashti['age'],bins,labels=age_groups,include_lowest=True)
kashti['age']
# How this will change the names in dataset based on grouping (Assignment)

ValueError: Bin labels must be one fewer than the number of bin edges

### **converting categories into dummies**
 - easy to use for computtation
 - Male Female (0,l)

In [36]:
pd.get_dummies(k['sex'])

     female  male
0         0     1
1         1     0
2         1     0
3         1     0
4         0     1
..      ...   ...
886       0     1
887       1     0
888       1     0
889       0     1
890       0     1

[891 rows x 2 columns]

In [3]:
i=1
while True:
    if i % 3 ==0:
        break
        print(i)
        i+=1

In [41]:
2**(3**2)

512

In [39]:
(2**3)**2

64

In [40]:
2**3**2

512

In [42]:
z=set('abcd')
'a' in z

True

In [44]:
def addite(list):
    list+= [1]

mylis=[1,2,3,4]
addite(mylis)
print(len(mylis))

5

In [48]:
a=[4, 3, 5, 7, 6]
b=[2, 10, 1, 9, 3]
c=sum(a)/len(a)
print(c)
d=sum(b)/len(b)
print(d)

5.0
5.0

In [49]:
import numpy as np
a=[4, 3, 5, 7, 6]
b=[2, 10, 1, 9, 3]
c=np.mean(a) 
print(c)
d= np.mean(b)
print(d)

5.0
5.0

In [50]:
import numpy as np
a=[4, 3, 5, 7, 6]
b=[2, 10, 1, 9, 3]
c=np.var(a) 
print(c)
d= np.var(b)
print(d)

2.0
14.0